---
kind: property
id: P:Autodesk.Revit.DB.Visual.Wave.TextureRealWorldOffsetX
source: html/1b94d1ce-863e-9b5e-bb10-a82ddca75b47.htm
---
# Autodesk.Revit.DB.Visual.Wave.TextureRealWorldOffsetX Property

The property labeled "Offset X" from the "Wave" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetX { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".